---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer
source: html/7709521d-9954-ef80-1f13-3bc6ee660d5d.htm
---
# Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer

The interface to be implemented by a server of the DirectContext3D external service.

## Syntax (C#)
```csharp
public interface IDirectContext3DServer : IExternalServer
```